# essential tools
brew "mas"
brew "htop"
brew "starship"
tap "qmx/repo"
brew "dotter"
brew "yadm"
tap "homebrew/cask"


# yubikey setup
brew "gnupg"
brew "yubikey-personalization"
brew "hopenpgp-tools"
brew "ykman"
brew "pinentry-mac"

# browsers
cask "finicky"
cask "brave-browser"
cask "google-chrome"
cask "firefox"

# productivity tools
cask "obsidian"
cask "rectangle"
cask "stats"
cask "1password"
mas "Bitwarden", id: 1352778147
mas "Todoist", id: 585829637

# printer/scanner software
mas "Brother iPrint&Scan", id: 1193539993

# keychron / qmk configurator
cask "via"

# cryptocurrency
cask "ledger-live"

# communications
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "WhatsApp", id: 1147396723
cask "skype"
cask "zoom"
cask "discord"

# networking
mas "WireGuard", id: 1451685025
mas "Tailscale", id: 1475387142

# development
brew "direnv"
cask "visual-studio-code"
cask "iterm2"
cask "rancher"

# development / react native
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
brew "watchman"
cask "flipper"

## ruby and node managers
brew "openssl"
brew "frum"
brew "fnm"
brew "graphicsmagick" # for fastlane icon plugin
brew "node" # some of the tools was breaking without having a globally installed node

## android stuff
tap "adoptopenjdk/openjdk"
cask "adoptopenjdk11"
cask "android-studio"
cask "android-sdk"


# music
mas "Logic Pro", id: 634148309
cask "native-access"

# video
brew "ffmpeg"
cask "vlc"

# photo
brew "exiftool"