tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "qmx/repo", "git@github.com:qmx/homebrew-repo.git"
tap "stripe/stripe-cli"
tap "wix/brew"
brew "direnv"
brew "dump1090-mutability"
brew "exiftool"
brew "ffmpeg"
brew "flyctl"
brew "git"
brew "git-crypt"
brew "gnupg"
brew "graphicsmagick"
brew "htop"
brew "mas"
brew "node"
brew "pinentry-mac"
brew "podman"
brew "scrcpy"
brew "starship"
brew "terraform"
brew "xcodes"
brew "yadm"
brew "ykman"
brew "ykpers"
brew "stripe/stripe-cli/stripe"
brew "wix/brew/applesimutils"
cask "1password"
cask "adoptopenjdk11"
cask "android-sdk"
cask "android-studio"
cask "brave-browser"
cask "discord"
cask "finicky"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "gqrx"
cask "grandperspective"
cask "iterm2"
cask "ledger-live"
cask "logseq"
cask "rectangle"
cask "skype"
cask "stats"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Brother iPrint&Scan", id: 1193539993
mas "GarageBand", id: 682658836
mas "Logic Pro", id: 634148309
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
