# essential tools
brew "mas"
brew "htop"
brew "starship"
tap "qmx/repo"
brew "dotter"

# yubikey setup
brew "gnupg"
brew "yubikey-personalization"
brew "hopenpgp-tools"
brew "ykman"
brew "pinentry-mac"

# browsers
cask "finicky"
cask "brave-browser"
cask "google-chrome"
cask "firefox"

# productivity tools
cask "obsidian"
cask "rectangle"
mas "1password", id: 1333542190
cask "eul"

# communications
mas "Slack", id: 803453959
mas "Telegram", id: 747648890

# networking
mas "WireGuard", id: 1451685025
mas "Tailscale", id: 1475387142

# development
cask "visual-studio-code"
cask "docker"
cask "iterm2"